common/models/Country.php

    public function all($order){
        return $this->find()->orderby($order)->all();
---
SELECT * FROM `country` ORDER BY `name DSC`

    public function find_pages($order,$pageSize = 5){
        $query = $this->find();
        $pagination = new Pagination([
            'defaultPageSize' => $pageSize,
            'totalCount' => $query->count(),
---
SELECT COUNT(*) FROM `country`